# ContinuousRailFilletCreationError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ContinuousRailFilletCreationError Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot create specified fillet at rail path corner.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContinuousRailFilletCreationError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousRailFilletCreationError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContinuousRailFilletCreationError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace